#     Вычислить число c заданной точностью d
#     Пример:
# - при $d = 0.001, π = 3.141.$    $10^{-1} ≤ d ≤10^{-10}$


d = input('Введите точность округления d в формате 0.001,  10^-1 ≤ d ≤10^-10: ')
d = d[2:len(d)]
num = 14/9

print(f'При заданной точности d = {d} число 14/9 = {round(num,len(d))}')

